In [9]:
import numpy as np
np.linspace(0,4,10)

array([0.        , 0.44444444, 0.88888889, 1.33333333, 1.77777778,
       2.22222222, 2.66666667, 3.11111111, 3.55555556, 4.        ])

In [11]:
np.logspace(0,2,3)

array([  1.,  10., 100.])

In [8]:
#Create a data frame with some items and and keep one condition to check age is less then 20.

import pandas as pd

In [4]:
cols = ["name","age","gender","job"]
cols

['name', 'age', 'gender', 'job']

In [14]:
user1 = pd.DataFrame([["Subhojit",18,"M","Student"],["Anish",26,"F","Employee"]],columns =cols)

In [15]:
user1

       name  age gender       job
0  Subhojit   18      M   Student
1     Anish   26      F  Employee

In [7]:
user1[user1.age < 20]

    name  age gender      job
0  Alice   19      f  student